# pandas

pandasとはPython用のデータ分析ライブラリ

種々の統計量の計算、データの可視化などもできる非常に優れたツールです。

In [100]:
import numpy as np
import pandas as pd

# seriesの生成

pandasには、Seriesと呼ばれる１次元のデータ構造を持つクラスが存在します。

Seriesクラスを生成するためには、Seriesメソッド(引数：data,index)を使用

In [101]:
series = pd.Series(data=[1,2,3,4,5],index=['A','B','C','D','E'])
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [102]:
array = np.arange(1,11)
index = 'a b c d e f g h i j '.split()

series = pd. Series(data=array,index=index)
series

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

# Seriesクラスの基本的な操作方法

# データの選択

In [103]:
series = pd.Series(data=[1,2,3,4,5],index=['A','B','C','D','E'])
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [104]:
series['A':'B']

A    1
B    2
dtype: int64

In [105]:
series['A']

1

# loc

インデックスを指定

In [106]:
series.loc['A':'D']

A    1
B    2
C    3
D    4
dtype: int64

In [107]:
series.loc[['B','D']]

B    2
D    4
dtype: int64

# iloc

データの位置を番号で指定する

In [108]:
series.iloc[1]

2

In [109]:
series.iloc[:2]

A    1
B    2
dtype: int64

# DataFrameの生成

DataFrameと呼ばれる２次元のデータ構造を持つクラスが存在します。

In [110]:
df = pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [111]:
df = pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]],index=['A','B','C'],columns=['C1','C2','C3'])
df

   C1  C2  C3
A   1   2   3
B   4   5   6
C   7   8   9

# head()メソッドを使うと上で５行だけを取り出します。

In [112]:
from sklearn.datasets import load_iris

iris = load_iris()
iris

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'frame': None,
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': '/Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages/sklearn/datasets/data/iris.csv'}

In [113]:
from sklearn.datasets import load_iris

iris = load_iris()
iris_df = pd.DataFrame(data=iris.data, columns=iris.feature_names)
iris_df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

# ファイルの読み込み

pandasを使うと、CSV, Excel, HTMLなどあらゆる形式のデータを読み込むことが可能です。

・read_csv
・read_excel
・read_html

In [114]:
df = pd.read_csv('iris.csv',nrows=500)
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

# データの大まかな内容を確認する

# 形状の確認

In [115]:
df.shape

(150, 6)

# 各種統計量を確認

In [116]:
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

# データ数と型を確認

In [117]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

# ユニークな値の数を確認

In [118]:
df.nunique()

Id               150
SepalLengthCm     35
SepalWidthCm      23
PetalLengthCm     43
PetalWidthCm      22
Species            3
dtype: int64

# 欠損値の数を確認

In [119]:
df.isnull().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

# 行名・列名を確認

In [120]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [121]:
df.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

 # データの選択と抽出

In [122]:
np.random.seed(10)

df = pd.DataFrame(data=np.random.randn(5,5),index=['A','B','C','D','E'],
                 columns=['C1','C2','C3','C4','C5'])
df

         C1        C2        C3        C4        C5
A  1.331587  0.715279 -1.545400 -0.008384  0.621336
B -0.720086  0.265512  0.108549  0.004291 -0.174600
C  0.433026  1.203037 -0.965066  1.028274  0.228630
D  0.445138 -1.136602  0.135137  1.484537 -1.079805
E -1.977728 -1.743372  0.266070  2.384967  1.123691

# 基本的な選択

In [123]:
df.loc['A']

C1    1.331587
C2    0.715279
C3   -1.545400
C4   -0.008384
C5    0.621336
Name: A, dtype: float64

In [124]:
df.loc[:,'C1']

A    1.331587
B   -0.720086
C    0.433026
D    0.445138
E   -1.977728
Name: C1, dtype: float64

In [125]:
df.loc['A',['C1','C3']]

C1    1.331587
C3   -1.545400
Name: A, dtype: float64

# 条件による選択

In [126]:
df > 0

      C1     C2     C3     C4     C5
A   True   True  False  False   True
B  False   True   True   True  False
C   True   True  False   True   True
D   True  False   True   True  False
E  False  False   True   True   True

In [127]:
df[df>0]

         C1        C2        C3        C4        C5
A  1.331587  0.715279       NaN       NaN  0.621336
B       NaN  0.265512  0.108549  0.004291       NaN
C  0.433026  1.203037       NaN  1.028274  0.228630
D  0.445138       NaN  0.135137  1.484537       NaN
E       NaN       NaN  0.266070  2.384967  1.123691

In [128]:
df['C1']>0

A     True
B    False
C     True
D     True
E    False
Name: C1, dtype: bool

In [129]:
df[df['C1']>0]

         C1        C2        C3        C4        C5
A  1.331587  0.715279 -1.545400 -0.008384  0.621336
C  0.433026  1.203037 -0.965066  1.028274  0.228630
D  0.445138 -1.136602  0.135137  1.484537 -1.079805

In [130]:
df[(df['C1']>0)&(df['C1']<1)]

         C1        C2        C3        C4        C5
C  0.433026  1.203037 -0.965066  1.028274  0.228630
D  0.445138 -1.136602  0.135137  1.484537 -1.079805

# データの追加と消去

# データの追加

In [131]:
df['new_column']=df['C1']*df['C2']
df

         C1        C2        C3        C4        C5  new_column
A  1.331587  0.715279 -1.545400 -0.008384  0.621336    0.952456
B -0.720086  0.265512  0.108549  0.004291 -0.174600   -0.191191
C  0.433026  1.203037 -0.965066  1.028274  0.228630    0.520947
D  0.445138 -1.136602  0.135137  1.484537 -1.079805   -0.505944
E -1.977728 -1.743372  0.266070  2.384967  1.123691    3.447917

# データの消去

dropメソッドで行名、列名を指定することが可能

inplaceという引数をTrueにする、dfが更新され、消去後にdfに置き換わる

In [132]:
df.drop(columns=['C1'])

         C2        C3        C4        C5  new_column
A  0.715279 -1.545400 -0.008384  0.621336    0.952456
B  0.265512  0.108549  0.004291 -0.174600   -0.191191
C  1.203037 -0.965066  1.028274  0.228630    0.520947
D -1.136602  0.135137  1.484537 -1.079805   -0.505944
E -1.743372  0.266070  2.384967  1.123691    3.447917

In [133]:
df

         C1        C2        C3        C4        C5  new_column
A  1.331587  0.715279 -1.545400 -0.008384  0.621336    0.952456
B -0.720086  0.265512  0.108549  0.004291 -0.174600   -0.191191
C  0.433026  1.203037 -0.965066  1.028274  0.228630    0.520947
D  0.445138 -1.136602  0.135137  1.484537 -1.079805   -0.505944
E -1.977728 -1.743372  0.266070  2.384967  1.123691    3.447917

In [134]:
df.drop(index =['A'],inplace=True)

In [135]:
df

         C1        C2        C3        C4        C5  new_column
B -0.720086  0.265512  0.108549  0.004291 -0.174600   -0.191191
C  0.433026  1.203037 -0.965066  1.028274  0.228630    0.520947
D  0.445138 -1.136602  0.135137  1.484537 -1.079805   -0.505944
E -1.977728 -1.743372  0.266070  2.384967  1.123691    3.447917

# 欠損値の処理

欠損値の処理は

・dropna :欠損しているデータを消去

・fillna :　欠損値を別の値で埋める

In [136]:
df = pd.DataFrame(data=[[1, 2, 3, np.nan, 4], 
                        [5, np.nan, 6, np.nan, 7],
                        [8, 9, 10, np.nan, 11],
                        [12, np.nan, np.nan, np.nan, 13],
                        [14, 15, 16, 17, 18]],
                  index=['A', 'B', 'C', 'D', 'E'],
                  columns=['C1', 'C2', 'C3', 'C4', 'C5'])
df

   C1    C2    C3    C4  C5
A   1   2.0   3.0   NaN   4
B   5   NaN   6.0   NaN   7
C   8   9.0  10.0   NaN  11
D  12   NaN   NaN   NaN  13
E  14  15.0  16.0  17.0  18

In [137]:
df.dropna()

   C1    C2    C3    C4  C5
E  14  15.0  16.0  17.0  18

In [138]:
df['C2'].dropna()

A     2.0
C     9.0
E    15.0
Name: C2, dtype: float64

# 特定の例について欠損値がある部分を消去

In [139]:
df['C2'].isnull()

A    False
B     True
C    False
D     True
E    False
Name: C2, dtype: bool

In [140]:
df[df['C2'].isnull() == False]　# 一番大事なC2の値は残す

SyntaxError: invalid character in identifier (<ipython-input-140-4d0635978e50>, line 1)

# 欠損値の数を指定して消去する

In [141]:
df.dropna(thresh = 3)

   C1    C2    C3    C4  C5
A   1   2.0   3.0   NaN   4
B   5   NaN   6.0   NaN   7
C   8   9.0  10.0   NaN  11
E  14  15.0  16.0  17.0  18

In [142]:
df.dropna(thresh = 3, axis=1)# axisは列に対して

   C1    C2    C3  C5
A   1   2.0   3.0   4
B   5   NaN   6.0   7
C   8   9.0  10.0  11
D  12   NaN   NaN  13
E  14  15.0  16.0  18

# 欠損値を別の値で置き換え

In [143]:
df['C2'].fillna(df['C2'].mean())

A     2.000000
B     8.666667
C     9.000000
D     8.666667
E    15.000000
Name: C2, dtype: float64

In [144]:
df.fillna(df.mean())

   C1         C2     C3    C4  C5
A   1   2.000000   3.00  17.0   4
B   5   8.666667   6.00  17.0   7
C   8   9.000000  10.00  17.0  11
D  12   8.666667   8.75  17.0  13
E  14  15.000000  16.00  17.0  18

# カテゴリカルなデータの操作

In [145]:
#　辞書型でも生成できる
df = pd.DataFrame({'C1': ['A', 'A', 'A', 'B', 'B', 'C', np.nan],
                   'C2': [20, 50, 60, 80, 100, 30, 50],
                   'C3': [40, 200, 100, 500, 40, 200, 40]})
df

    C1   C2   C3
0    A   20   40
1    A   50  200
2    A   60  100
3    B   80  500
4    B  100   40
5    C   30  200
6  NaN   50   40

カテゴリとデータの数を確認

In [146]:
df['C1'].value_counts()

A    3
B    2
C    1
Name: C1, dtype: int64

In [147]:
df[df['C1'] == 'A']

  C1  C2   C3
0  A  20   40
1  A  50  200
2  A  60  100

In [148]:
df['C1'].fillna(df['C1'].mode()[0])#modeは最頻値

0    A
1    A
2    A
3    B
4    B
5    C
6    A
Name: C1, dtype: object

In [149]:
df#更新されていない

    C1   C2   C3
0    A   20   40
1    A   50  200
2    A   60  100
3    B   80  500
4    B  100   40
5    C   30  200
6  NaN   50   40

In [150]:
df['C1'] =df['C1'].fillna(df['C1'].mode()[0])
df

  C1   C2   C3
0  A   20   40
1  A   50  200
2  A   60  100
3  B   80  500
4  B  100   40
5  C   30  200
6  A   50   40

# 割合を計算する

In [151]:
round(df['C1'].value_counts() / len(df), 2)# roundで２桁に納める

A    0.57
B    0.29
C    0.14
Name: C1, dtype: float64

# グループ化して各種統計量を計算する

In [152]:
df.groupby('C1')

In [153]:
df.groupby('C1').sum()

     C2   C3
C1
A   180  380
B   180  540
C    30  200

In [154]:
df.groupby('C1').mean()

    C2   C3
C1
A   45   95
B   90  270
C   30  200

In [155]:
df.groupby('C1').max()

     C2   C3
C1
A    60  200
B   100  500
C    30  200

# DataFrameの結合
concatメソッド

In [156]:
df_1 = pd.DataFrame(data=np.random.randn(5, 5), index=['A', 'B', 'C', 'D', 'E'],
                 columns=['C1', 'C2', 'C3', 'C4', 'C5'])

df_2 = pd.DataFrame(data=np.random.randn(5, 5), index=['F', 'G', 'H', 'I', 'J'],
                 columns=['C1', 'C2', 'C3', 'C4', 'C5'])

In [157]:
df_1

         C1        C2        C3        C4        C5
A  1.672622  0.099149  1.397996 -0.271248  0.613204
B -0.267317 -0.549309  0.132708 -0.476142  1.308473
C  0.195013  0.400210 -0.337632  1.256472 -0.731970
D  0.660232 -0.350872 -0.939433 -0.489337 -0.804591
E -0.212698 -0.339140  0.312170  0.565153 -0.147420

In [158]:
df_2

         C1        C2        C3        C4        C5
F -0.025905  0.289094 -0.539879  0.708160  0.842225
G  0.203581  2.394704  0.917459 -0.112272 -0.362180
H -0.232182 -0.501729  1.128785 -0.697810 -0.081122
I -0.529296  1.046183 -1.418556 -0.362499 -0.121906
J  0.319356  0.460903 -0.215790  0.989072  0.314754

In [159]:
pd.concat([df_1, df_2])#縦方向

         C1        C2        C3        C4        C5
A  1.672622  0.099149  1.397996 -0.271248  0.613204
B -0.267317 -0.549309  0.132708 -0.476142  1.308473
C  0.195013  0.400210 -0.337632  1.256472 -0.731970
D  0.660232 -0.350872 -0.939433 -0.489337 -0.804591
E -0.212698 -0.339140  0.312170  0.565153 -0.147420
F -0.025905  0.289094 -0.539879  0.708160  0.842225
G  0.203581  2.394704  0.917459 -0.112272 -0.362180
H -0.232182 -0.501729  1.128785 -0.697810 -0.081122
I -0.529296  1.046183 -1.418556 -0.362499 -0.121906
J  0.319356  0.460903 -0.215790  0.989072  0.314754

In [170]:
pd.concat([df_1, df_2], axis=1, sort=True)#横方向　axis=1

,C1,C2,C3,C4,C5,C1,C2,C3,C4,C5
A,1.672622,0.099149,1.397996,-0.271248,0.613204,NaN,NaN,NaN,NaN,NaN
B,-0.267317,-0.549309,0.132708,-0.476142,1.308473,NaN,NaN,NaN,NaN,NaN
C,0.195013,0.400210,-0.337632,1.256472,-0.731970,NaN,NaN,NaN,NaN,NaN
D,0.660232,-0.350872,-0.939433,-0.489337,-0.804591,NaN,NaN,NaN,NaN,NaN
E,-0.212698,-0.339140,0.312170,0.565153,-0.147420,NaN,NaN,NaN,NaN,NaN
F,NaN,NaN,NaN,NaN,NaN,-0.025905,0.289094,-0.539879,0.708160,0.842225
G,NaN,NaN,NaN,NaN,NaN,0.203581,2.394704,0.917459,-0.112272,-0.362180
H,NaN,NaN,NaN,NaN,NaN,-0.232182,-0.501729,1.128785,-0.697810,-0.081122
I,NaN,NaN,NaN,NaN,NaN,-0.529296,1.046183,-1.418556,-0.362499,-0.121906
J,NaN,NaN,NaN,NaN,NaN,0.319356,0.460903,-0.215790,0.989072,0.314754

# 関数の適用
applyメソッドを使う

In [161]:
df = pd.DataFrame(data=np.random.randn(5, 5), index=['A', 'B', 'C', 'D', 'E'],
                 columns=['C1', 'C2', 'C3', 'C4', 'C5'])
df

         C1        C2        C3        C4        C5
A  2.467651 -1.508321  0.620601 -1.045133 -0.798009
B  1.985085  1.744814 -1.856185 -0.222774 -0.065848
C -2.131712 -0.048831  0.393341  0.217265 -1.994394
D  1.107708  0.244544 -0.061912 -0.753893  0.711959
E  0.918269 -0.482093  0.089588  0.826999 -1.954512

In [162]:
def square(x):
    return x ** 2

In [163]:
df['C1'].apply(square)# .apply(関数名)

A    6.089302
B    3.940561
C    4.544197
D    1.227018
E    0.843218
Name: C1, dtype: float64

# 複数の引数を取る場合
# 呼び出し時に特定のデータを指定する

In [164]:
def add(x, y):
    return x + y

In [165]:
add(df['C1'], df['C2'])

A    0.959330
B    3.729899
C   -2.180543
D    1.352252
E    0.436176
dtype: float64

# dfを引数に指定する

In [166]:
def add(df):
    return df['C1'] + df['C2']

In [167]:
df.apply(add, axis=1)

A    0.959330
B    3.729899
C   -2.180543
D    1.352252
E    0.436176
dtype: float64

# 複数の戻り値がある場合

In [168]:
def square_and_cube(x):
    return pd.Series([x**2, x**3])

In [169]:
df[['squared', 'cubed']] = df['C1'].apply(square_and_cube)
df

         C1        C2        C3        C4        C5   squared      cubed
A  2.467651 -1.508321  0.620601 -1.045133 -0.798009  6.089302  15.026272
B  1.985085  1.744814 -1.856185 -0.222774 -0.065848  3.940561   7.822347
C -2.131712 -0.048831  0.393341  0.217265 -1.994394  4.544197  -9.686919
D  1.107708  0.244544 -0.061912 -0.753893  0.711959  1.227018   1.359177
E  0.918269 -0.482093  0.089588  0.826999 -1.954512  0.843218   0.774301